garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1777.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD3CARH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="MD3CARH" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x21F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH" edc:desc="" edc:mask="0x1f" edc:name="CH" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CH0" edc:desc="" edc:mask="0x1" edc:name="CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH1" edc:desc="" edc:mask="0x1" edc:name="CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH2" edc:desc="" edc:mask="0x1" edc:name="CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH3" edc:desc="" edc:mask="0x1" edc:name="CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH4" edc:desc="" edc:mask="0x1" edc:name="CH4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD3CH" edc:desc="" edc:mask="0x1f" edc:name="MD3CH" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD3CH0" edc:desc="" edc:mask="0x1" edc:name="MD3CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD3CH1" edc:desc="" edc:mask="0x1" edc:name="MD3CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD3CH2" edc:desc="" edc:mask="0x1" edc:name="MD3CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD3CH3" edc:desc="" edc:mask="0x1" edc:name="MD3CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD3CH4" edc:mask="0x1" edc:name="MD3CH4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="5" edc:beginaddr="0x280" edc:endaddr="0x2A0" edc:regionid="sfr5">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x280"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONA" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x28C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODA0" edc:desc="" edc:mask="0x1" edc:name="ODA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA1" edc:desc="" edc:mask="0x1" edc:name="ODA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA2" edc:desc="" edc:mask="0x1" edc:name="ODA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA3" edc:mask="0x1" edc:name="ODA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODA4" edc:desc="" edc:mask="0x1" edc:name="ODA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA5" edc:desc="" edc:mask="0x1" edc:name="ODA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODA6" edc:mask="0x1" edc:name="ODA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODA7" edc:mask="0x1" edc:name="ODA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONB" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x28D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODB0" edc:mask="0x1" edc:name="ODB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODB1" edc:mask="0x1" edc:name="ODB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODB2" edc:mask="0x1" edc:name="ODB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODB3" edc:mask="0x1" edc:name="ODB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODB4" edc:desc="" edc:mask="0x1" edc:name="ODB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB5" edc:desc="" edc:mask="0x1" edc:name="ODB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB6" edc:desc="" edc:mask="0x1" edc:name="ODB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODB7" edc:desc="" edc:mask="0x1" edc:name="ODB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONC" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x28E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODC0" edc:desc="" edc:mask="0x1" edc:name="ODC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC1" edc:desc="" edc:mask="0x1" edc:name="ODC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC2" edc:desc="" edc:mask="0x1" edc:name="ODC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC3" edc:desc="" edc:mask="0x1" edc:name="ODC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC4" edc:desc="" edc:mask="0x1" edc:name="ODC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC5" edc:desc="" edc:mask="0x1" edc:name="ODC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC6" edc:desc="" edc:mask="0x1" edc:name="ODC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODC7" edc:desc="" edc:mask="0x1" edc:name="ODC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
