garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1777.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCOND" edc:nzwidth="8" edc:por="11111111" edc:_addr="0x30F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRD0" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD1" edc:mask="0x1" edc:name="SLRD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD2" edc:mask="0x1" edc:name="SLRD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD3" edc:mask="0x1" edc:name="SLRD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD4" edc:mask="0x1" edc:name="SLRD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD5" edc:mask="0x1" edc:name="SLRD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD6" edc:mask="0x1" edc:name="SLRD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD7" edc:mask="0x1" edc:name="SLRD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SLRCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="SLRCONE" edc:nzwidth="8" edc:por="-----111" edc:_addr="0x310">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRE0" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRE1" edc:mask="0x1" edc:name="SLRE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRE2" edc:mask="0x1" edc:name="SLRE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR8" edc:desc="" edc:name="CCPR8" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x311">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR8L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR8L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x311">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR8H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR8H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x312">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP8CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP8CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x313">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP8MODE" edc:desc="" edc:mask="0xf" edc:name="CCP8MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP8FMT" edc:desc="" edc:mask="0x1" edc:name="CCP8FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8OUT" edc:desc="" edc:mask="0x1" edc:name="CCP8OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP8EN" edc:desc="" edc:mask="0x1" edc:name="CCP8EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP8MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP8MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP8MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP8MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP8MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CCP8CAP" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CCP8CAP" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x314">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0xf" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS3" edc:desc="" edc:mask="0x1" edc:name="CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP8CTS" edc:desc="" edc:mask="0xf" edc:name="CCP8CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP8CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP8CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP8CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP8CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8CTS3" edc:desc="" edc:mask="0x1" edc:name="CCP8CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="MD1CON0" edc:desc="" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="MD1CON0" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x315">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BIT" edc:desc="" edc:mask="0x1" edc:name="BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1BIT" edc:desc="" edc:mask="0x1" edc:name="MD1BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD1OPOL" edc:desc="" edc:mask="0x1" edc:name="MD1OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1OUT" edc:desc="" edc:mask="0x1" edc:name="MD1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD1EN" edc:desc="" edc:mask="0x1" edc:name="MD1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
