garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1777.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC1CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC1CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x58E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x3" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:desc="" edc:mask="0x1" edc:name="FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:desc="" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x3" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACFM" edc:desc="" edc:mask="0x1" edc:name="DACFM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACNSS1" edc:desc="" edc:mask="0x1" edc:name="DACNSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC1NSS" edc:desc="" edc:mask="0x3" edc:name="DAC1NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS" edc:desc="" edc:mask="0x3" edc:name="DAC1PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC1OE2" edc:desc="" edc:mask="0x1" edc:name="DAC1OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE1" edc:desc="" edc:mask="0x1" edc:name="DAC1OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1FM" edc:desc="" edc:mask="0x1" edc:name="DAC1FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1EN" edc:desc="" edc:mask="0x1" edc:name="DAC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC1NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC1NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1NSS1" edc:desc="" edc:mask="0x1" edc:name="DAC1NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC1PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC1PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC1REF" edc:desc="" edc:name="DAC1REF" edc:nzwidth="0x10" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x58F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC1REFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC1REFL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x58F">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC1CON1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC1REF0" edc:desc="" edc:mask="0x1" edc:name="DAC1REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF1" edc:desc="" edc:mask="0x1" edc:name="DAC1REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF2" edc:desc="" edc:mask="0x1" edc:name="DAC1REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF3" edc:desc="" edc:mask="0x1" edc:name="DAC1REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF4" edc:desc="" edc:mask="0x1" edc:name="DAC1REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF5" edc:desc="" edc:mask="0x1" edc:name="DAC1REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF6" edc:desc="" edc:mask="0x1" edc:name="DAC1REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF7" edc:desc="" edc:mask="0x1" edc:name="DAC1REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R5" edc:desc="" edc:mask="0x1" edc:name="R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R6" edc:desc="" edc:mask="0x1" edc:name="R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R7" edc:desc="" edc:mask="0x1" edc:name="R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC1R0" edc:desc="" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R1" edc:desc="" edc:mask="0x1" edc:name="DAC1R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R2" edc:desc="" edc:mask="0x1" edc:name="DAC1R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R3" edc:desc="" edc:mask="0x1" edc:name="DAC1R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R4" edc:desc="" edc:mask="0x1" edc:name="DAC1R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R5" edc:desc="" edc:mask="0x1" edc:name="DAC1R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R6" edc:desc="" edc:mask="0x1" edc:name="DAC1R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R7" edc:desc="" edc:mask="0x1" edc:name="DAC1R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF5" edc:desc="" edc:mask="0x1" edc:name="REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF6" edc:desc="" edc:mask="0x1" edc:name="REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF7" edc:desc="" edc:mask="0x1" edc:name="REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC1REFH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC1REFH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x590">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC1CON2"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC1REF8" edc:desc="" edc:mask="0x1" edc:name="DAC1REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF9" edc:desc="" edc:mask="0x1" edc:name="DAC1REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF10" edc:desc="" edc:mask="0x1" edc:name="DAC1REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF11" edc:desc="" edc:mask="0x1" edc:name="DAC1REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF12" edc:desc="" edc:mask="0x1" edc:name="DAC1REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF13" edc:desc="" edc:mask="0x1" edc:name="DAC1REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF14" edc:desc="" edc:mask="0x1" edc:name="DAC1REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1REF15" edc:desc="" edc:mask="0x1" edc:name="DAC1REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R8" edc:desc="" edc:mask="0x1" edc:name="R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R9" edc:desc="" edc:mask="0x1" edc:name="R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R10" edc:desc="" edc:mask="0x1" edc:name="R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R11" edc:desc="" edc:mask="0x1" edc:name="R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R12" edc:desc="" edc:mask="0x1" edc:name="R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R13" edc:desc="" edc:mask="0x1" edc:name="R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R14" edc:desc="" edc:mask="0x1" edc:name="R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R15" edc:desc="" edc:mask="0x1" edc:name="R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC1R8" edc:desc="" edc:mask="0x1" edc:name="DAC1R8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R9" edc:desc="" edc:mask="0x1" edc:name="DAC1R9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R10" edc:desc="" edc:mask="0x1" edc:name="DAC1R10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R11" edc:desc="" edc:mask="0x1" edc:name="DAC1R11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R12" edc:desc="" edc:mask="0x1" edc:name="DAC1R12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R13" edc:desc="" edc:mask="0x1" edc:name="DAC1R13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R14" edc:desc="" edc:mask="0x1" edc:name="DAC1R14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC1R15" edc:desc="" edc:mask="0x1" edc:name="DAC1R15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF8" edc:desc="" edc:mask="0x1" edc:name="REF8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF9" edc:desc="" edc:mask="0x1" edc:name="REF9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF10" edc:desc="" edc:mask="0x1" edc:name="REF10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF11" edc:desc="" edc:mask="0x1" edc:name="REF11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF12" edc:desc="" edc:mask="0x1" edc:name="REF12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF13" edc:desc="" edc:mask="0x1" edc:name="REF13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF14" edc:desc="" edc:mask="0x1" edc:name="REF14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF15" edc:desc="" edc:mask="0x1" edc:name="REF15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC2CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC2CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x591">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x3" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:desc="" edc:mask="0x1" edc:name="FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:desc="" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x3" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACFM" edc:desc="" edc:mask="0x1" edc:name="DACFM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACNSS1" edc:desc="" edc:mask="0x1" edc:name="DACNSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC2NSS" edc:desc="" edc:mask="0x3" edc:name="DAC2NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS" edc:desc="" edc:mask="0x3" edc:name="DAC2PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC2OE2" edc:desc="" edc:mask="0x1" edc:name="DAC2OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2OE1" edc:desc="" edc:mask="0x1" edc:name="DAC2OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2FM" edc:desc="" edc:mask="0x1" edc:name="DAC2FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2EN" edc:desc="" edc:mask="0x1" edc:name="DAC2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC2NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC2NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2NSS1" edc:desc="" edc:mask="0x1" edc:name="DAC2NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC2PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC2PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC2REF" edc:desc="" edc:name="DAC2REF" edc:nzwidth="0x10" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x592">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC2REFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC2REFL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x592">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC2CON1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC2REF0" edc:desc="" edc:mask="0x1" edc:name="DAC2REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF1" edc:desc="" edc:mask="0x1" edc:name="DAC2REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF2" edc:desc="" edc:mask="0x1" edc:name="DAC2REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF3" edc:desc="" edc:mask="0x1" edc:name="DAC2REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF4" edc:desc="" edc:mask="0x1" edc:name="DAC2REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF5" edc:desc="" edc:mask="0x1" edc:name="DAC2REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF6" edc:desc="" edc:mask="0x1" edc:name="DAC2REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2REF7" edc:desc="" edc:mask="0x1" edc:name="DAC2REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R5" edc:desc="" edc:mask="0x1" edc:name="R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R6" edc:desc="" edc:mask="0x1" edc:name="R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R7" edc:desc="" edc:mask="0x1" edc:name="R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC2R0" edc:desc="" edc:mask="0x1" edc:name="DAC2R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R1" edc:desc="" edc:mask="0x1" edc:name="DAC2R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R2" edc:desc="" edc:mask="0x1" edc:name="DAC2R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R3" edc:desc="" edc:mask="0x1" edc:name="DAC2R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R4" edc:desc="" edc:mask="0x1" edc:name="DAC2R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R5" edc:desc="" edc:mask="0x1" edc:name="DAC2R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R6" edc:desc="" edc:mask="0x1" edc:name="DAC2R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC2R7" edc:desc="" edc:mask="0x1" edc:name="DAC2R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF5" edc:desc="" edc:mask="0x1" edc:name="REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF6" edc:desc="" edc:mask="0x1" edc:name="REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF7" edc:desc="" edc:mask="0x1" edc:name="REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
