garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1777.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DAC4REF" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DAC4REF" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-01073_5bit_DAC_wNSS_v2_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x597">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DAC4CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC4R" edc:desc="" edc:mask="0x1f" edc:name="DAC4R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC4R0" edc:desc="" edc:mask="0x1" edc:name="DAC4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4R1" edc:desc="" edc:mask="0x1" edc:name="DAC4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4R2" edc:desc="" edc:mask="0x1" edc:name="DAC4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4R3" edc:desc="" edc:mask="0x1" edc:name="DAC4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4R4" edc:desc="" edc:mask="0x1" edc:name="DAC4R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:SFRFieldDef edc:cname="DAC4REF0" edc:desc="" edc:mask="0x1" edc:name="DAC4REF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4REF1" edc:desc="" edc:mask="0x1" edc:name="DAC4REF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4REF2" edc:desc="" edc:mask="0x1" edc:name="DAC4REF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4REF3" edc:desc="" edc:mask="0x1" edc:name="DAC4REF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC4REF4" edc:desc="" edc:mask="0x1" edc:name="DAC4REF4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC5CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC5CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x598">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x3" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE2" edc:desc="" edc:mask="0x1" edc:name="OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:desc="" edc:mask="0x1" edc:name="OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:desc="" edc:mask="0x1" edc:name="FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:desc="" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:desc="" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:desc="" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:desc="" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="" edc:mask="0x3" edc:name="DACNSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE2" edc:desc="" edc:mask="0x1" edc:name="DACOE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACOE1" edc:desc="" edc:mask="0x1" edc:name="DACOE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACFM" edc:desc="" edc:mask="0x1" edc:name="DACFM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DACNSS0" edc:desc="" edc:mask="0x1" edc:name="DACNSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACNSS1" edc:desc="" edc:mask="0x1" edc:name="DACNSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DAC5NSS" edc:desc="" edc:mask="0x3" edc:name="DAC5NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC5PSS" edc:desc="" edc:mask="0x3" edc:name="DAC5PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC5OE2" edc:desc="" edc:mask="0x1" edc:name="DAC5OE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC5OE1" edc:desc="" edc:mask="0x1" edc:name="DAC5OE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC5FM" edc:desc="" edc:mask="0x1" edc:name="DAC5FM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC5EN" edc:desc="" edc:mask="0x1" edc:name="DAC5EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="DAC5NSS0" edc:desc="" edc:mask="0x1" edc:name="DAC5NSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC5NSS1" edc:desc="" edc:mask="0x1" edc:name="DAC5NSS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC5PSS0" edc:desc="" edc:mask="0x1" edc:name="DAC5PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC5PSS1" edc:desc="" edc:mask="0x1" edc:name="DAC5PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC5REF" edc:desc="" edc:name="DAC5REF" edc:nzwidth="0x10" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x599">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC5REFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC5REFL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02635_dac_nbit__ctrl_V3.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x599">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="DAC5CON1"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="REF" edc:desc="" edc:mask="0xff" edc:name="REF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC5REF0" edc:desc="" edc:mask="0x1" edc:name="DAC5REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF1" edc:desc="" edc:mask="0x1" edc:name="DAC5REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF2" edc:desc="" edc:mask="0x1" edc:name="DAC5REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF3" edc:desc="" edc:mask="0x1" edc:name="DAC5REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF4" edc:desc="" edc:mask="0x1" edc:name="DAC5REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF5" edc:desc="" edc:mask="0x1" edc:name="DAC5REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF6" edc:desc="" edc:mask="0x1" edc:name="DAC5REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5REF7" edc:desc="" edc:mask="0x1" edc:name="DAC5REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="R0" edc:desc="" edc:mask="0x1" edc:name="R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R1" edc:desc="" edc:mask="0x1" edc:name="R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R2" edc:desc="" edc:mask="0x1" edc:name="R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R3" edc:desc="" edc:mask="0x1" edc:name="R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R4" edc:desc="" edc:mask="0x1" edc:name="R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R5" edc:desc="" edc:mask="0x1" edc:name="R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R6" edc:desc="" edc:mask="0x1" edc:name="R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="R7" edc:desc="" edc:mask="0x1" edc:name="R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="DAC5R0" edc:desc="" edc:mask="0x1" edc:name="DAC5R0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R1" edc:desc="" edc:mask="0x1" edc:name="DAC5R1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R2" edc:desc="" edc:mask="0x1" edc:name="DAC5R2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R3" edc:desc="" edc:mask="0x1" edc:name="DAC5R3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R4" edc:desc="" edc:mask="0x1" edc:name="DAC5R4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R5" edc:desc="" edc:mask="0x1" edc:name="DAC5R5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R6" edc:desc="" edc:mask="0x1" edc:name="DAC5R6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DAC5R7" edc:desc="" edc:mask="0x1" edc:name="DAC5R7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.3">
                <edc:SFRFieldDef edc:cname="REF0" edc:desc="" edc:mask="0x1" edc:name="REF0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF1" edc:desc="" edc:mask="0x1" edc:name="REF1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF2" edc:desc="" edc:mask="0x1" edc:name="REF2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF3" edc:desc="" edc:mask="0x1" edc:name="REF3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF4" edc:desc="" edc:mask="0x1" edc:name="REF4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF5" edc:desc="" edc:mask="0x1" edc:name="REF5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF6" edc:desc="" edc:mask="0x1" edc:name="REF6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REF7" edc:desc="" edc:mask="0x1" edc:name="REF7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
