garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1777.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG4INS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG4INS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x610">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INS" edc:desc="" edc:mask="0xf" edc:name="INS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="INS0" edc:desc="" edc:mask="0x1" edc:name="INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS1" edc:desc="" edc:mask="0x1" edc:name="INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS2" edc:desc="" edc:mask="0x1" edc:name="INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS3" edc:desc="" edc:mask="0x1" edc:name="INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG4INS0" edc:desc="" edc:mask="0x1" edc:name="RG4INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4INS1" edc:desc="" edc:mask="0x1" edc:name="RG4INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4INS2" edc:desc="" edc:mask="0x1" edc:name="RG4INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4INS3" edc:desc="" edc:mask="0x1" edc:name="RG4INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PRG4CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PRG4CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x611">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OS" edc:desc="" edc:mask="0x1" edc:name="OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REDG" edc:desc="" edc:mask="0x1" edc:name="REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FEDG" edc:desc="" edc:mask="0x1" edc:name="FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG4GO" edc:desc="" edc:mask="0x1" edc:name="RG4GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4OS" edc:desc="" edc:mask="0x1" edc:name="RG4OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4MODE" edc:desc="" edc:mask="0x3" edc:name="RG4MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RG4REDG" edc:desc="" edc:mask="0x1" edc:name="RG4REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4FEDG" edc:desc="" edc:mask="0x1" edc:name="RG4FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG4EN" edc:desc="" edc:mask="0x1" edc:name="RG4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG4MODE0" edc:desc="" edc:mask="0x1" edc:name="RG4MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4MODE1" edc:desc="" edc:mask="0x1" edc:name="RG4MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----rnn" edc:cname="PRG4CON1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PRG4CON1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x612">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RPOL" edc:desc="" edc:mask="0x1" edc:name="RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FPOL" edc:desc="" edc:mask="0x1" edc:name="FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:desc="" edc:mask="0x1" edc:name="RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG4RPOL" edc:desc="" edc:mask="0x1" edc:name="RG4RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4FPOL" edc:desc="" edc:mask="0x1" edc:name="RG4FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4RDY" edc:desc="" edc:mask="0x1" edc:name="RG4RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PRG4CON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PRG4CON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x613">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISET" edc:desc="" edc:mask="0x1f" edc:name="ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="ISET0" edc:desc="" edc:mask="0x1" edc:name="ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET1" edc:desc="" edc:mask="0x1" edc:name="ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET2" edc:desc="" edc:mask="0x1" edc:name="ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET3" edc:desc="" edc:mask="0x1" edc:name="ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET4" edc:desc="" edc:mask="0x1" edc:name="ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG4ISET" edc:desc="" edc:mask="0x1f" edc:name="RG4ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RG4ISET0" edc:desc="" edc:mask="0x1" edc:name="RG4ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4ISET1" edc:desc="" edc:mask="0x1" edc:name="RG4ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4ISET2" edc:desc="" edc:mask="0x1" edc:name="RG4ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4ISET3" edc:desc="" edc:mask="0x1" edc:name="RG4ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG4ISET4" edc:desc="" edc:mask="0x1" edc:name="RG4ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3DC" edc:desc="" edc:name="PWM3DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x614">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM3DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM3DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x614">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM3DC0" edc:desc="" edc:mask="0x1" edc:name="PWM3DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC1" edc:desc="" edc:mask="0x1" edc:name="PWM3DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x615">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3DC2" edc:desc="" edc:mask="0x1" edc:name="PWM3DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC3" edc:desc="" edc:mask="0x1" edc:name="PWM3DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC4" edc:desc="" edc:mask="0x1" edc:name="PWM3DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC5" edc:desc="" edc:mask="0x1" edc:name="PWM3DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC6" edc:desc="" edc:mask="0x1" edc:name="PWM3DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC7" edc:desc="" edc:mask="0x1" edc:name="PWM3DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC8" edc:desc="" edc:mask="0x1" edc:name="PWM3DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DC9" edc:desc="" edc:mask="0x1" edc:name="PWM3DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM3CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM3CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x616">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM3POL" edc:desc="" edc:mask="0x1" edc:name="PWM3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3OUT" edc:desc="" edc:mask="0x1" edc:name="PWM3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM3EN" edc:desc="" edc:mask="0x1" edc:name="PWM3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM4DC" edc:desc="" edc:name="PWM4DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM4DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM4DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x617">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM4DC0" edc:desc="" edc:mask="0x1" edc:name="PWM4DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC1" edc:desc="" edc:mask="0x1" edc:name="PWM4DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM4DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM4DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x618">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DC2" edc:desc="" edc:mask="0x1" edc:name="DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC3" edc:desc="" edc:mask="0x1" edc:name="DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC4" edc:desc="" edc:mask="0x1" edc:name="DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC5" edc:desc="" edc:mask="0x1" edc:name="DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC6" edc:desc="" edc:mask="0x1" edc:name="DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC7" edc:desc="" edc:mask="0x1" edc:name="DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC8" edc:desc="" edc:mask="0x1" edc:name="DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC9" edc:desc="" edc:mask="0x1" edc:name="DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM4DC2" edc:desc="" edc:mask="0x1" edc:name="PWM4DC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC3" edc:desc="" edc:mask="0x1" edc:name="PWM4DC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC4" edc:desc="" edc:mask="0x1" edc:name="PWM4DC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC5" edc:desc="" edc:mask="0x1" edc:name="PWM4DC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC6" edc:desc="" edc:mask="0x1" edc:name="PWM4DC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC7" edc:desc="" edc:mask="0x1" edc:name="PWM4DC7" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC8" edc:desc="" edc:mask="0x1" edc:name="PWM4DC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM4DC9" edc:desc="" edc:mask="0x1" edc:name="PWM4DC9" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWMPW2" edc:mask="0x1" edc:name="PWMPW2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW3" edc:mask="0x1" edc:name="PWMPW3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW4" edc:mask="0x1" edc:name="PWMPW4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW5" edc:mask="0x1" edc:name="PWMPW5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW6" edc:mask="0x1" edc:name="PWMPW6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW7" edc:mask="0x1" edc:name="PWMPW7" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW8" edc:mask="0x1" edc:name="PWMPW8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW9" edc:mask="0x1" edc:name="PWMPW9" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn----" edc:cname="PWM4CON" edc:desc="" edc:impl="0xb0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00----" edc:name="PWM4CON" edc:nzwidth="8" edc:por="0-00----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x619">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM4POL" edc:desc="" edc:mask="0x1" edc:name="PWM4POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4OUT" edc:desc="" edc:mask="0x1" edc:name="PWM4OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4EN" edc:desc="" edc:mask="0x1" edc:name="PWM4EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM9DC" edc:desc="" edc:name="PWM9DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
          <edc:SFRDef edc:access="nn------" edc:cname="PWM9DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM9DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x3" edc:name="DC" edc:nzwidth="2"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="DC0" edc:desc="" edc:mask="0x1" edc:name="DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DC1" edc:desc="" edc:mask="0x1" edc:name="DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="PWM9DC0" edc:desc="" edc:mask="0x1" edc:name="PWM9DC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM9DC1" edc:desc="" edc:mask="0x1" edc:name="PWM9DC1" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:AdjustPoint edc:offset="0x6"/>
                <edc:SFRFieldDef edc:cname="PWMPW0" edc:mask="0x1" edc:name="PWMPW0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PWMPW1" edc:mask="0x1" edc:name="PWMPW1" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
